package ru.skillbranch.devintensive.repositories

// TODO 02
// Редактирование профиля
// Реализуй бизнес логику режима редактирования профиля пользователя и сохранение измененных данных в SharedPreferences,
// режим редактирования должен сохраняться при перевороте экрана
// Необходимо реализовать сохранение введенных данных пользователя (данные сохраняются при нажатии пользователем кнопки
// сохранения данных (в EDIT_MODE @id/btn_edit)) с применением ViewModel и PreferencesRepository. Введенные данные
// должны быть сохранены в SharedPreferences. Режим редактирования должен сохраняться при перевороте экрана

class PreferencesRepository {
}